In [5]:
import pandas as pd
df = pd.read_csv('../data/gapminder.tsv',sep='\t')

In [6]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [ ]:
df.describe()

In [8]:
type(df['country'])

pandas.core.series.Series

In [9]:
type(df.loc[0])

pandas.core.series.Series

In [10]:
df.head(3)

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [11]:
df.tail(1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [12]:
type(df)

pandas.core.frame.DataFrame

In [13]:
df.shape

(1704, 6)

In [14]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [16]:
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [18]:
# 데이터 불러오고 직후
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

In [20]:
country_df = df['country']
type(country_df)

pandas.core.series.Series

In [21]:
country_df

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [22]:
subset=df[['country']]
type(subset)

pandas.core.frame.DataFrame

In [23]:
subset

          country
0     Afghanistan
1     Afghanistan
2     Afghanistan
3     Afghanistan
4     Afghanistan
...           ...
1699     Zimbabwe
1700     Zimbabwe
1701     Zimbabwe
1702     Zimbabwe
1703     Zimbabwe

[1704 rows x 1 columns]

In [24]:
df.head(1)

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314

In [25]:
df.loc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [26]:
df.iloc[0]

country      Afghanistan
continent           Asia
year                1952
lifeExp           28.801
pop              8425333
gdpPercap     779.445314
Name: 0, dtype: object

In [27]:
dict1 = {'a':1, 'b':2}
dict1['c']

KeyError: 'c'

In [ ]:
df.loc[-1]

In [ ]:
df.iloc[-1]

In [31]:
df.loc[[0, 99, 999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [32]:
df.iloc[[0, 99, 999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [33]:
df.loc[0:2]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [34]:
df.iloc[0:2]

       country continent  year  lifeExp      pop   gdpPercap
0  Afghanistan      Asia  1952   28.801  8425333  779.445314
1  Afghanistan      Asia  1957   30.332  9240934  820.853030

In [35]:
df.loc[: , ['year','pop']]

      year       pop
0     1952   8425333
1     1957   9240934
2     1962  10267083
3     1967  11537966
4     1972  13079460
...    ...       ...
1699  1987   9216418
1700  1992  10704340
1701  1997  11404948
1702  2002  11926563
1703  2007  12311143

[1704 rows x 2 columns]

In [38]:
df.iloc[:, [0, 2]]

          country  year
0     Afghanistan  1952
1     Afghanistan  1957
2     Afghanistan  1962
3     Afghanistan  1967
4     Afghanistan  1972
...           ...   ...
1699     Zimbabwe  1987
1700     Zimbabwe  1992
1701     Zimbabwe  1997
1702     Zimbabwe  2002
1703     Zimbabwe  2007

[1704 rows x 2 columns]

In [37]:
df['year']

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [ ]:
df.groupby('year')[['lifeExp', 'pop', 'gdpPercap']].mean()

In [ ]:
select avg(lifeExp) from df group by year;

In [ ]:
grouped_year_df = df.groupby('year')

In [ ]:
grouped_year_df

In [ ]:
for i in grouped_year_df:
    print(i[0])
    display(i[1])

In [ ]:
grouped_year_df_lifeExp = df.groupby('year')['lifeExp']

In [ ]:
grouped_year_df_lifeExp

In [ ]:
for i in grouped_year_df:
    print(i[0])
    display(i[1][['lifeExp', 'pop', 'gdpPercap']])

In [ ]:
for i in grouped_year_df_lifeExp:
    print(i[0])
    display(i[1])

In [ ]:
grouped_year_df_lifeExp.mean()

In [ ]:
df.groupby('year')[['lifeExp', 'pop', 'gdpPercap']].mean()

In [ ]:
grouped = df.groupby(['year', 'continent'])

In [ ]:
for i in grouped:
    print(i[0])
    display(i[1])

In [ ]:
df.groupby(['year', 'continent'])['lifeExp'].mean()

In [ ]:
df.groupby(['continent', 'year'])['lifeExp'].mean()

In [ ]:
year_life_expectancy = df.groupby('year')['lifeExp'].mean()
year_life_expectancy

In [ ]:
year_life_expectancy.plot()

In [ ]:
import matplotlib.pyplot as plt

plt.plot(year_life_expectancy.index, year_life_expectancy.values, 'r:*')

In [ ]:
import numpy as np

In [ ]:
s = pd.Series(np.array(['Wes McKinney','Creator of Pandas']))
s

In [ ]:
{0 : 'Wes McKinney', 1 : 'Creator of Pandas'}

In [ ]:
s = pd.Series(['Wes McKinney','Creator of Pandas'],index=['Person','Who'])
s

In [ ]:
pd.Series({'Person' : 'Wes McKinney', 'Who' : 'Creator of Pandas'})

In [ ]:
s[['Person']]

In [ ]:
s.loc[['Person']]

In [ ]:
s.iloc[0:1]

In [ ]:
s = pd.Series({'Person' : 'Wes McKinney', 'age' : 30})
s

In [ ]:
s.shape

In [ ]:
s.dtype

In [ ]:
s.index

In [ ]:
s.info()

In [ ]:
s.values

In [ ]:
pd.DataFrame({'Person' : ['Wes McKinney'], 'age' : [30]})

In [ ]:
scientists = pd.DataFrame({
                        'Name':['Rosaline Franklin','William Gosset'],
                        'Occupation':['Chemist','Statistician'],
                        'Born':['1920-07-25','1876-06-13'],
                        'Died':['1958-04-16','1937-10-16'],
                        'Age':[37,61]})
scientists

In [ ]:
pd.DataFrame(
[['Rosaline Franklin', 'Chemist', '1920-07-25', '1958-04-16', 37],
 ['William Gosset', 'Statistician', '1876-06-13', '1937-10-16', 61]],
    columns = ['Name', 'Occupation','Born','Died', 'Age'],
    index = ['First', 'Second']
)

In [ ]:
scientists = pd.DataFrame(
data={'Occupation':['Chemist','Statistician'],
'Born':['1920-07-25','1876-06-13'],
'Died':['1958-04-16','1937-10-16'],
'Age':[37,61]},
index=['Rosaline Franklin','William Gosset'],
columns=['Occupation','Born','Age','Died'])
scientists

In [ ]:
scientists.loc['William Gosset']

In [ ]:
scientists['Age']

In [ ]:
scientists.iloc[0]

In [ ]:
scientists.index[0]

In [ ]:
scientists.columns[2]

In [ ]:
scientists = pd.read_csv('data/pandas/scientists.csv')
ages = scientists['Age']
scientists

In [ ]:
ages

In [ ]:
scientists['Occupation'].isin(['Chemist'])

In [ ]:
scientists.count()

In [ ]:
ages.count()

In [ ]:
scientists.info()

In [ ]:
scientists['Occupation'].value_counts()

In [ ]:
scientists.groupby('Occupation')['Occupation'].count()

In [ ]:
scientists.value_counts()

In [ ]:
ages.sum()

In [ ]:
scientists

In [ ]:
scientists.sum()

In [ ]:
ages.mean()

In [ ]:
'a' * 3

In [ ]:
print(ages.min())
print(ages.quantile(q = 0.25))
print(ages.median())   # print(ages.quantile(q = 0.50))
print(ages.quantile(q = 0.75))
print(ages.max())

In [ ]:
# 4분위값             
ages   # 37 41 | 45 56 | 61 66 | 77 90

In [ ]:
scientists.head(1)

In [ ]:
scientists.describe()

In [ ]:
scientists.replace('Chemist', 'Scientist')

In [ ]:
scientists.sample(3)

In [ ]:
scientists.sample(frac=0.35)

In [ ]:
scientists2 = scientists.sample(frac=1)
scientists2

In [ ]:
scientists2.sort_index(axis = 0, ascending=True)

In [ ]:
scientists2.sort_values('Age', ascending = True, axis = 0)

In [ ]:
ages.to_frame()

In [ ]:
# scientists.transpose()
scientists.T

In [ ]:
# 시리즈에만 쓰임
scientists['Occupation'].unique()

In [ ]:
scientists['Occupation'].nunique()